7.Напишите программу, которая определяет, является ли заданное число совершенным числом (число, равное сумме своих делителей, исключая само число). Выведите сообщение с результатом.




def is_perfect_number(num):
    if num < 1:
        return False
    divisors_sum = sum(i for i in range(1, num) if num % i == 0)
    return divisors_sum == num

number_to_check = 28 

if is_perfect_number(number_to_check):
    print(f"{number_to_check} является совершенным числом.")
else:
    print(f"{number_to_check} не является совершенным числом.")

